case_files/waterEntryWedge30/domain/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


size    0.05;
xMin    -2.5;
xMax     2.5;
yMin     0;
yMax     0.05;
zMin    -5.5;
zMax     2;
xCells  #calc "std::floor( ( $xMax - $xMin ) / $size )";
yCells  1;
zCells  #calc "std::floor( ( $zMax - $zMin ) / $size )";


scale   1;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)

    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $xCells
        $yCells
        $zCells
    )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other
    // bcs
    oversetPatch
    {
        type overset;
        faces ();
    }

    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (2 6 5 1)
            //(1 5 4 0)
            //(3 7 6 2)
            (0 4 7 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    frontAndBack
    {
	    type empty;
	    faces
	    (
	        (1 5 4 0)
	        (3 7 6 2)
	    );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
