case_files/waterEntryWedge30/domain/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Load the additional patches, patchFields etc.
libs            ("liboverset.so");

application     overInterDyMFoam ;

startFrom       latestTime;//startTime;

startTime       0.0;

stopAt          endTime;

endTime         9.65;

deltaT          0.001;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  3;

writeCompression on;

timeFormat      general;

timePrecision   3;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;
maxAlphaCo      1;
maxDeltaT       0.1;
functions
{
    
    #include "forces"
}

// ************************************************************************* //
